src/cf/InformationRegisters/ИсторияСтатусовWMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовWMS</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыWMS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСтатусовWMS/Ext/ManagerModule.bsl
// Функция получает текущий статус WMS документа 
//
// Параметры:
//           - "СсылкаНаОбъект" - ссылка на объект БД (Обязательный)
//           - "НаДату"         - дата, на которую необходимо определить статус WMS объекта
Функция ПолучитьТекущийСтатусWMS(СсылкаНаОбъект, НаДату = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		Возврат РегистрыСведений.ИсторияСтатусовWMS.ПолучитьПоследнее(, Новый Структура("Объект", СсылкаНаОбъект)).Статус;
	Иначе
		Возврат РегистрыСведений.ИсторияСтатусовWMS.ПолучитьПоследнее(НаДату, Новый Структура("Объект", СсылкаНаОбъект)).Статус;
	КонецЕсли;
	
КонецФункции	

// Процедура добавляет для объекта новый статус 
//
// Параметры:
//           - "СсылкаНаОбъект" - ссылка на объект БД (Обязательный)
//           - "НовыйСтатус"    - Новый статус WMS для объекта (Перечисление "СтатусыWMS") (Обязательный)
Процедура ДобавитьОбъектуНовыйСтатусWMS(СсылкаНаОбъект, НовыйСтатус) Экспорт
	
	новМенЗаписиСтатусаWMS = РегистрыСведений.ИсторияСтатусовWMS.СоздатьМенеджерЗаписи();
	новМенЗаписиСтатусаWMS.Период = ТекущаяДата();
	новМенЗаписиСтатусаWMS.Объект = СсылкаНаОбъект; 
	новМенЗаписиСтатусаWMS.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	новМенЗаписиСтатусаWMS.Статус = НовыйСтатус;
	новМенЗаписиСтатусаWMS.Записать();
	
КонецПроцедуры
